import {Component} from '@angular/core';
import {NavController, Platform} from 'ionic-angular';

@Component({
  selector: 'page-facebook',
  templateUrl: 'facebook.html'
})

export class FacebookPage {

  constructor(public navCtrl: NavController, public platform: Platform) {

  }

  posts: any[] = [
    {
      title: 'Projotno',
      body: 'পল্লী চিকিৎসক, প্যারামেডিক, ডি এম এফ, ফার্মাসিস্ট আপনাদের জ্ঞান এবং দক্ষতা বৃদ্ধিতে আমরা আমরা একটি সিস্টেম তৈরি করেছি যার মাধ্যমে বিভিন্ন তথ্যের উপর পড়াশোনা এবং টেস্ট দিতে পারবেন। নিম্নের লিঙ্কে ক্লিক করে উচ্চরক্তচাপ সম্পর্কে তথ্যগুলো পড়ুন এবং টেস্ট টি দিন। এই বিষয়ে আপনার মতামত জানাতে ভুলবেন না। https://www.onlineexambuilder.com/hypertension/exam-168838'
    }
    , {
      title: 'Projotno',
      body: 'আপনি যদি পল্লীচিকিৎসক, প্যারামেডিক, ফার্মাসিস্ট, ডি এম এফ ফার্মাসিস্ট বা স্বাস্থ্য সেবক হয়ে থাকেন তবে চিকুনগুনিয়া সম্পর্কিত তথ্যগুলো পড়ুন এবং কুইজে অংশ নিন। আপনাদের জ্ঞান বৃদ্ধিতেই আমাদের এই প্রচেষ্টা! চিগুনগুনিয়া সম্পর্কিত তথ্যগুলো পড়ার পর নিম্নের লিংকে ক্লিক করে পরীক্ষাটি দিনঃ https://goo.gl/forms/fz61EndRo3uxUFZy1 চিকুনগুনিয়া ভাইরাস কী? চিকুনগুনিয়া ভাইরাস টোগা ভাইরাস গোত্রের ভাইরাস। মশাবাহিত হওয়ার কারণে একে আরবো ভাইরাসও বলে। ডেঙ্গু ও জিকা ভাইরাস ও একই মশার মাধ্যমে ছড়ায় এবং প্রায় একই রকম রোগের লক্ষণ দেখা যায়। রোগের লক্ষণ সমূহ কী কী? (১) হঠাৎ জ্বর আসা সঙ্গে প্রচণ্ড গিঁটে গিঁটে ব্যথা। (২) প্রচণ্ড মাথাব্যথা (৩) শরীরে ঠাণ্ডা অনুভূতি (Chill) (৪) বমি বমি ভাব অথবা বমি (৫) চামড়ায় লালচে দানা (Skin Rash) (৬) মাংসপেশিতে ব্যথা (Muscle Pain) বাহক কে? এডিস ইজিপ্টি ((Ades aegypti) এবং এডিস এলবোপিকটাস (Ades albopictus) মশার মাধ্যমে এ রোগ ছড়ায়। মশাগুলোর শরীরের ও পায়ের সাদা কালো ডোরাকাটা দাগ দেখে সহজেই চেনা যায়। কারা ঝুঁকির মুখে? এ মশাগুলো সাধারণত পরিষ্কার বদ্ধ পানিতে জন্মায় এবং যাদের আশপাশে এ রকম মশা বৃদ্ধির জায়গা আছে, সে সব মানুষেরা বেশি ঝুঁকির মধ্যে থাকে। মশা কখন কামড়ায়? এ ধরনের মশা সাধারণত দিনের বেলা (ভোর বেলা অথবা সন্ধ্যার সময়) কামড়ায়। এছাড়াও চিকুনগুনিয়া ভাইরাস আক্রান্ত রক্তদাতার রক্ত গ্রহণ করলে এবং ল্যাবরেটরীতে নমুনা পরীক্ষার সময়ে অসাবধানতায় এ রোগ ছড়াতে পারে। রোগের প্রকাশকাল কখন? সাধারনতঃ বাহক মশা কামড়ানোর ৩-৭ দিন পর। প্রতিরোধ ও নিয়ন্ত্রণ করা যায় কিভাবে? এ রোগ প্রতিরোধের কোনো টিকা নাই। ব্যক্তিগত সচেতনতাই চিকুনগুনিয়া ভাইরাস সংক্রমণ প্রতিরোধের প্রধান উপায়। মশার কামড় থেকে সুরক্ষা পাওয়া যাবে কিভাবে? (১) শরীরের বেশির ভাগ অংশ ঢাকা রাখা (ফুল হাতা শার্ট এবং ফুল প্যান্ট পরা) (২) জানালায় নেট লাগানো, প্রয়োজন ছাড়া দরজা জানালা খোলা না রাখা (৩) ঘুমানোর সময় মশারি ব্যবহার করা (৪) শরীরে মশা প্রতিরোধক ক্রিম ব্যবহার করা চিকিৎসা: চিকুনগুনিয়ার কোনো সুনির্দিষ্ট চিকিৎসা নেই। আক্রান্ত ব্যক্তিকে বিশ্রাম নিতে হবে, প্রচুর পানি ও তরলজাতীয় খাবার খেতে হবে এবং প্রয়োজনে জ্বর ও ব্যথার জন্য প্যারাসিটামল ট্যাবলেট এবং চিকিৎসকের পরামর্শ অনুসারে ওষুধ খেতে হবে। তবে কোনো অবস্থাতেই অ্যান্টিবায়োটিক গ্রহণ করা যাবে না।'
    }
    , {
      title: 'Projotno',
      body: 'আপনি কি পল্লী চিকিৎসক, প্যারামেডিক, মেডিকেল ডিপ্লোমাধারী বা ফার্মাসিস্ট? আপনার পেশা, আপনার মোবাইল ফোনের ব্র্যান্ডের নাম এবং মডেল নাম্বার কমেন্টে লিখুন বা ইনবক্সে ম্যাসেজ দিন। আপনাদের জ্ঞান, দক্ষতা এবং অর্থনৈতিক উন্নয়নের জন্য আমরা একটি সিস্টেম তৈরি করতে যাচ্ছি। এই সিস্টেমকে আপনাদের উপযুক্ত করে তোলার জন্য আপনাদের সম্পর্কিত কিছু তথ্য খুবই গুরুত্বপূর্ণ। আমাদের অনলাইন এই সিস্টেমটি প্রস্তুত করতে আপনাদের মোবাইলের ফিচার জানা আমাদের খুবই প্রয়োজনীয়। আপনাদের উন্নয়নেই হবে বাংলাদেশের উন্নয়ন।'
    }
    ,
    {
      title: 'Projotno',
      body: `আপনি কি প্যারামেডিক, পল্লী চিকিৎসক, কমুনিটি হেলথ ওয়ার্কার বা মেডিকেল ডিপ্লোমাধারী? আপনি কি নিজ এলাকায় বা গ্রামে চিকিৎসাসেবা দিচ্ছেন? আপনাদের সার্বিক উন্নয়নে কাজ করতে যাচ্ছে প্রযত্ন! সেজন্য আপনাদের মতামত, চাহিদা বা পরামর্শ আমাদের কাছে খুবই গুরুত্বপূর্ণ। আপনি যদি এই পেশার সাথে জড়িত থাকেন তবে এই পোষ্টে কমেন্ট করুন বা ইনবক্সে ম্যাসেজ করে তা জানিয়ে দিন। বাংলাদেশের চিকিৎসা ব্যবস্থার সবচেয়ে গুরুত্বপূর্ণ অংশ হচ্ছে আপনারা, আপনাদের উন্নয়নে বদলে যাবে বাংলাদেশ!`
    }
  ];

}
